Revit 2016 API
Pipe.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector)
 Creates a new pipe that connects two connectors. The new pipe will have the same diameter and system type as the start connector. If the connection fails, the method throws an exception.
Create(Document, ElementId, ElementId, Connector, XYZ)
 Creates a new pipe that connects to the connector. The new pipe will have the same diameter and system type as the connector. If the connection fails, the method throws an exception.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new pipe from two points.
See Also
Pipe Class
Pipe Members
Autodesk.Revit.DB.Plumbing Namespace